In [5]:
import numpy as np

In [6]:
import pandas as pd

In [7]:
l = (10, 20, 30)

In [8]:
m = ('a','b','c')

In [9]:
pd.Series(m)

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series(l)

0    10
1    20
2    30
dtype: int64

In [11]:
from numpy.random import randn

In [12]:
df = pd.DataFrame(randn(4,3),['a','b','c','d'],['x','y','z'])

In [16]:
df

          x         y         z
a  1.192667  2.247827 -0.970085
b -0.120382  0.066009 -1.171090
c -0.123749  1.352688 -0.692690
d -0.170177  0.841502  1.908345

In [17]:
df['x']

a    1.192667
b   -0.120382
c   -0.123749
d   -0.170177
Name: x, dtype: float64

In [18]:
df.loc['b']

x   -0.120382
y    0.066009
z   -1.171090
Name: b, dtype: float64

In [19]:
df['l'] =df['x']+ df['y']

In [20]:
df

          x         y         z         l
a  1.192667  2.247827 -0.970085  3.440493
b -0.120382  0.066009 -1.171090 -0.054374
c -0.123749  1.352688 -0.692690  1.228939
d -0.170177  0.841502  1.908345  0.671326

In [21]:
df.drop('l', axis=1)

          x         y         z
a  1.192667  2.247827 -0.970085
b -0.120382  0.066009 -1.171090
c -0.123749  1.352688 -0.692690
d -0.170177  0.841502  1.908345

In [22]:
df[df['x']>0]['y']

a    2.247827
Name: y, dtype: float64

In [23]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [24]:
hier_index = list(zip(outside,inside))

In [25]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [28]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [27]:
df

          x         y         z         l
a  1.192667  2.247827 -0.970085  3.440493
b -0.120382  0.066009 -1.171090 -0.054374
c -0.123749  1.352688 -0.692690  1.228939
d -0.170177  0.841502  1.908345  0.671326

In [32]:
df = pd.DataFrame(randn(6,2),hier_index,('A',"B"))

In [33]:
df

             A         B
G1 1  0.390968  1.432109
   2 -1.061356 -0.527319
   3  0.362211 -0.877418
G2 1 -0.517915 -0.485383
   2  0.298701  0.752836
   3 -1.756098 -1.699618

In [37]:
df.loc['G1'].loc[1]['A']

0.3909675133795231

In [38]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [43]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.fillna(value=5)

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  5.0  5.0  3

In [54]:
data = {'Company':['AB','AB','CD','CD','EF','EF'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,300,140,150,124,135]}

In [55]:
df = pd.DataFrame(data)

In [56]:
df

  Company   Person  Sales
0      AB      Sam    200
1      AB  Charlie    300
2      CD      Amy    140
3      CD  Vanessa    150
4      EF     Carl    124
5      EF    Sarah    135

In [58]:
df.groupby('Company').count()

         Person  Sales
Company
AB            2      2
CD            2      2
EF            2      2

In [61]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [67]:
pd.read_

,Start Date,Start Time,End Date,End Time,Event Title,All Day Event,No End Time,Event Description,Contact,Contact Email,Contact Phone,Location,Category,Mandatory,Registration,Maximum,Last Date To Register
0,9/5/2011,3:00:00 PM,9/5/2011,NaN,Social Studies Dept. Meeting,N,Y,Department meeting,Chris Gallagher,cgallagher@schoolwires.com,814-555-5179,High School,2,N,N,25,9/2/2011
1,9/5/2011,6:00:00 PM,9/5/2011,8:00:00 PM,Curriculum Meeting,N,N,Curriculum Meeting,Chris Gallagher,cgallagher@schoolwires.com,814-555-5179,High School,2,N,N,25,9/2/2011